{
	"@metadata": {
		"authors": [
			"Ajeje Brazorf",
			"Amire80",
			"Eduardo Medina",
			"Huei Tan",
			"Robby",
			"Umherirrender",
			"Verdy p",
			"Yupik"
		]
	},
	"wikistories-extensionname": "{{name}}",
	"wikistories-extensiondesc": "{{desc|name=Wikistories|url=https://www.mediawiki.org/wiki/Extension:Wikistories}}",
	"right-edit-story": "{{doc-right|edit-story}}",
	"action-edit-story": "{{doc-action|edit-story}}",
	"deletepage-deletestory": "Text of checkbox above confirm button in delete page to delete all linked stories.",
	"wikistories-beta-feature-message": "Title of the beta feature to show stories on article pages.",
	"wikistories-beta-feature-description": "Description of the beta feature to show stories on article pages.",
	"prefs-wikistories": "Section title for the Wikistories preferences on the 'appearance' preferences tab.",
	"wikistories-pref-showdiscovery-message": "Description of the Wikistories preference to show the discovery section on articles.",
	"wikistories-pref-showdiscovery-help-message": "Help message of the Wikistories preference to show the discovery section on articles.",
	"wikistories-recentchangesflags-letter": "Flag (letter) to show on Recent Changes next to the lines that represent edit to stories associated with articles",
	"wikistories-recentchangesflags-title": "Title (tooltip) to show the Recent Changes Wikistories flag letter",
	"wikistories-recentchangesflags-legend": "Legend of the Recent Changes Wikistories flag letter",
	"wikistories-rcfilters-hidewikistories-label": "Label of the RC filter to show edits to wikistories on articles",
	"wikistories-rcfilters-hidewikistories-description": "Description of the RC filter to show edits to wikistories on articles",
	"rcshowhidewikistories": "Toggle to show/hide wikistories edits on old recent changes and watchlist interfaces.\n\nParameters:\n* $1 - a link with the text {{msg-mw|rcshowhidewikistories-show}} or {{msg-mw|rcshowhidewikistories-hide}}",
	"rcshowhidewikistories-show": "{{doc-actionlink}}\nOption text in [[Special:RecentChanges]] in conjunction with {{msg-mw|rcshowhidewikistories}}.\n\nSee also:\n* {{msg-mw|rcshowhidewikistories-hide}}\n{{Identical|Show}}",
	"rcshowhidewikistories-hide": "{{doc-actionlink}}\nOption text in [[Special:RecentChanges]] in conjunction with {{msg-mw|rcshowhidewikistories}}.\n\nSee also:\n* {{msg-mw|rcshowhidewikistories-show}}\n{{Identical|Hide}}",
	"storybuilder": "Name of the Story Builder special page as listed on Special:SpecialPages",
	"wikistories-specialstorybuilder-title": "Title of the special page to create a story.",
	"wikistories-specialstorybuilder-loading": "Temporary message indicating that the story builder is currently loading on Special:StoryBuilder",
	"wikistories-specialstorybuilder-nojswarning": "Message indicating that JavaScript is required to use Special:StoryBuilder",
	"wikistories-specialstorybuilder-mustbeloggedin": "Message indicating that the user needs to be logged in to use the Story Builder.",
	"wikistories-specialstorybuilder-invalidsubpage": "Message indicating that no subpage or an invalid subpage was supplied in the URL.",
	"wikistories-search-inputplaceholder": "Text used as placeholder for the input bar in Search view",
	"wikistories-search-cuetext": "Message shown when no search input has been provided by user in Search view",
	"wikistories-search-noresultstext": "Message shown when no results are found for user input in Search view",
	"wikistories-search-navigator-title": "Title for Navigator component when used in Search view",
	"wikistories-search-navigator-title-selected-info": "Title for Navigator component when images are selected in Search view.\n\nParameters:\n* $1 - number of images selected",
	"wikistories-story-goto-publish": "Text for a button in the Story view to continue to publish step\n{{identical|Next}}",
	"wikistories-story-selecttext": "Text used for an text selection button in the CurrentFrame view",
	"wikistories-story-edittext-duplicate": "Text message for editing guiding feedback when duplicate story text is found",
	"wikistories-story-edittext-outdated": "Text message for editing guiding feedback when the text appears to be outdated with regards to the article text",
	"wikistories-story-edittext-done": "Text used for a done selection button in the Navigator when editing story text",
	"wikistories-story-edittext-initial": "Initial text message for editing guiding feedback",
	"wikistories-story-edittext-medium": "Text message for editing guiding feedback when user starts editing",
	"wikistories-story-edittext-last": "Text message for editing guiding feedback when edit threshold is met",
	"wikistories-story-replaceimage": "Text used for the menu option to replace an image in the Story view",
	"wikistories-story-deleteframe": "Text used for the menu option to delete a story frame in the Story view",
	"wikistories-story-feedback": "Text used for the menu option to go to the Wikistories project talk page",
	"wikistories-story-navigator-title": "Title for Navigator component in the Story view when creating a new story",
	"wikistories-story-navigator-title-edit": "Title for Navigator component in the Story view when editing an existing story",
	"wikistories-story-navigator-title-edittext": "Title for Navigator component in the Story view when editing the text",
	"wikistories-imageattribution-author-unknown": "Text used in the ImageAttribution component when the image author is unknown",
	"wikistories-article-navigator-title": "Title for Navigator component when used in Article view",
	"wikistories-article-loading": "Text used for a header in the Article view as the article loads",
	"wikistories-article-usetext": "Text used for a button in the Article view.",
	"wikistories-article-info-banner-sentence": "Text used for the info section in the Article view as the feature introduction",
	"wikistories-alert-okbuttontext": "Text of the OK button on the generic alert dialog.",
	"wikistories-confirmdialog-cancel": "Label of the cancel button of the confirm dialog in Story view",
	"wikistories-confirmdialog-ok": "Label of the OK button of the confirm dialog in Story view\n{{identical|OK}}",
	"wikistories-confirmdialog-delete-title": "Title for the confirm dialog to delete a story page in Story view",
	"wikistories-confirmdialog-delete-message": "Text message for the confirm dialog to delete a story page in Story view",
	"wikistories-confirmdialog-delete-accept": "Text for the button to confirm deleting a story page in Story view.\n\n{{Identical|Delete}}",
	"wikistories-confirmdialog-discardstory-title": "Title for the confirm dialog to discard a whole Wikistory in Story view",
	"wikistories-confirmdialog-discardstory-message": "Text message for the confirm dialog to discard a whole Wikistory in Story view",
	"wikistories-confirmdialog-discardedits-title": "Title for the confirm dialog to discard edits made to a story",
	"wikistories-confirmdialog-discardedits-message": "Text message for the confirm dialog to discard edits make to a story",
	"wikistories-confirmdialog-discardstory-accept": "Text for the button to confirm discarding a whole Wikistory in Story view.",
	"wikistories-storyviewer-textsize-title": "Title of the textsize dialog in the Story Viewer",
	"wikistories-storyviewer-textsize-label-small": "Label of the radio button to set the text size to 'small' in the text size dialog in the Story Viewer\n{{identical|Small}}",
	"wikistories-storyviewer-textsize-label-regular": "Label of the radio button to set the text size to 'regular' in the text size dialog in the Story Viewer",
	"wikistories-storyviewer-textsize-label-large": "Label of the radio button to set the text size to 'large' in the text size dialog in the Story Viewer\n{{identical|Large}}",
	"wikistories-toast-maxframes-addingmore": "Text message for the toast warning when trying to add more frames beyond the max limit from Story view.\n\nParameters:\n* $1 - maximum number of frames allowed",
	"wikistories-toast-maxframes-selecting": "Text message for the toast warning when trying to select more images beyond the max limit from the Search view.\n\nParameters:\n* $1 - maximum number of frames allowed",
	"wikistories-error-notenoughframes-title": "Title of the error dialog when trying to publish a story that doesn't have enough frames.",
	"wikistories-error-notenoughframes-message": "Error message when trying to publish a story that doesn't have enough frames.\n\nParameters:\n* $1 - minimum number of pages for a story\n* $2 - number of pages missing",
	"wikistories-error-frameswithouttext-title": "Title of the error dialog when trying to publish a story that is missing text in some pages.",
	"wikistories-error-frameswithouttext-message": "Error message when trying to publish a story that is missing text in some pages.\n\nParameters:\n* $1 - number of pages without text",
	"wikistories-builder-article-not-available": "Text of the article page when article is not available from Wikipedia",
	"wikistories-builder-publishform-navigator-title": "Title for Navigator component when used in PublishForm view",
	"wikistories-builder-publishform-placeholder": "Placeholder of the story title text input on the publish form.",
	"wikistories-builder-publishform-summary-input-label": "Label of the story summary text input on the publish form.",
	"wikistories-builder-publishform-summary-input-placeholder": "Placeholder of the story summary text input on the publish form.",
	"wikistories-builder-publishform-publishbutton": "Text of the publish button on the publish form.",
	"wikistories-builder-publishform-info": "Information section about where will the published story be available.",
	"wikistories-builder-publishform-invalidtitle-empty": "Error message when no story title is provided on the publish form.",
	"wikistories-builder-publishform-invalidtitle-format": "Error message when the provided story title is invalid.",
	"wikistories-builder-publishform-invalidtitle-duplicate": "Error message when trying to create a story with a title that already exists.",
	"wikistories-builder-publishform-invalidtitle-notfound": "Error message when trying to edit a story but a story with the given title doesn't seem to exist.",
	"wikistories-builder-publishform-saveerror": "Error message when the publish request fails",
	"wikistories-builder-publishform-saving": "Text shown while the app is attempting to save and publish story",
	"wikistories-builder-publishform-watch": "Label of the checkbox to watch the story on the publish form",
	"wikistories-builder-publishform-saving-done": "Congratulation message on the publish form after a story has been successfully published.",
	"wikistories-builder-publishform-gotostory": "Button text to view the story that has been published",
	"wikistories-builder-publishform-sharestory": "Button text to share the story that has been published",
	"wikistories-builder-licensing-with-terms": "Text notifying user of licenses that story will be published under.\nParameters:\n* $1 - terms of service URL\n* $2 - CC-BY-SA 3.0 license URL\n* $3 - GFDL license URL",
	"wikistories-nojs-form-label-related-article": "Text for the no js form input label for related article",
	"wikistories-nojs-form-label-frame": "Text for the no js form input label for frame.\nParameters:\n* $1 - Frame number, starting at 1",
	"wikistories-nojs-form-label-image": "Text for the no js form input label for image\n\n{{Identical|Image}}",
	"wikistories-nojs-form-label-text": "Text for the no js form input label for text",
	"wikistories-nojs-form-categories-title": "Title of the form section for categories",
	"wikistories-nojs-form-categories-label": "Label of the text area to edit story categories",
	"wikistories-nojs-viewer-error": "Text for missing images error message.\nParameters:\n* $1 - Number of images missing",
	"wikistories-nojs-viewer-no-article": "Text for no article linked to story",
	"wikistories-discover-cta-text": "Text for a button in the Discover section to start the builder step",
	"wikistories-discover-cta-text-subheader": "Subheader text for a button in the Discover section to start the builder step",
	"wikistories-storyviewer-next-story-header": "Text for the header on next story page",
	"wikistories-storyviewer-next-story-viewtext": "Text for the view cta on next story page\n{{identical|View}}",
	"wikistories-storyviewer-textsize": "Text for the button to change text size in the viewer",
	"wikistories-storyviewer-edit": "Text for the button to edit a story from the viewer",
	"wikistories-storyviewer-talk": "Text for the button to go to the story talk page",
	"wikistories-storyviewer-cover-page-heading": "Heading text to accompany the story title for each cover page at the beggining of each story in the viewer",
	"wikistories-file-not-found": "Error message when a file used in a story is not found in any known repo.\nParameters:\n* $1 - name of the file",
	"wikistories-from-article-not-found": "Error message when the specific related article doesn't exist.\nParameters:\n* $1 - article title",
	"wikistories-invalid-format": "Error message when the story does not conform to the schema",
	"wikistories-not-enough-frames": "Error message when the story does not have enough frames",
	"wikistories-too-many-frames": "Error message when the story has too many frames",
	"wikistories-text-too-long": "Error message when the text on a frame is too long.\nParameters:\n* $1 - index of the frame (starting at 1)\n* $2 - Length of the text\n* $3 - Maximum length allowed",
	"wikistories-no-image-category": "Tracking Categories for story no image found",
	"wikistories-no-image-category-desc": "Description of the Tracking Categories for story no image found",
	"wikistories-no-related-article": "Tracking Categories for story has no related article",
	"wikistories-no-related-article-desc": "Description of the Tracking Categories for story has no related article",
	"wikistories-outdated-text-category": "Tracking Categories for story with outdated text",
	"wikistories-outdated-text-category-desc": "Description of the Tracking Categories for story with outdated text",
	"echo-category-title-wikistories-action": "Label for the Wikistories notification category on Special:Preferences",
	"wikistories-notification-articlechanged-header": "Main message for the notification indicating that a story needs to be reviewed following an article edit.\nParameters:\n* $1 - Title of the article that was edited\n* $2 - Title of the story that needs to be reviewed"
}
